In [2]:
from pandas import Series,DataFrame
import pandas as pd

obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = Series([4,7,-5,3],index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['d'] = 6
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [8]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [9]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [12]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
'b' in obj2

True

In [14]:
sdata = {'Ohio':35000,'Texas':7100}
obj3 = Series(sdata)
obj3

Ohio     35000
Texas     7100
dtype: int64

In [15]:
states = ['California','Ohio']
obj4 = Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
dtype: float64

In [16]:
pd.isnull(obj4)

California     True
Ohio          False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
dtype: bool

In [18]:
obj4.isnull()

California     True
Ohio          False
dtype: bool

In [19]:
obj3

Ohio     35000
Texas     7100
dtype: int64

In [20]:
obj4

California        NaN
Ohio          35000.0
dtype: float64

In [21]:
obj3+obj4

California        NaN
Ohio          70000.0
Texas             NaN
dtype: float64

In [22]:
obj4.name = 'population'
obj4

California        NaN
Ohio          35000.0
Name: population, dtype: float64

In [23]:
obj4.index.name = 'state'

In [24]:
obj4

state
California        NaN
Ohio          35000.0
Name: population, dtype: float64

In [27]:
obj4.index = ['Bob','Steve']
obj4

Bob          NaN
Steve    35000.0
Name: population, dtype: float64

In [28]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002],
        'pop':[1.5,1.7,3.6,2.4,2.9]
       }
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [30]:
frame2 = DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [32]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [33]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [34]:
frame2.ix['three']

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
frame2['debt'] = 16.5

In [36]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [37]:
frame2['debt'] = np.arange(5.)

In [38]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [39]:
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [40]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [41]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [43]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [44]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [45]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [47]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [48]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [49]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [50]:
obj = Series(range(3),index=['a','b','c'])
index = obj.index

In [51]:
index

Index(['a', 'b', 'c'], dtype='object')

In [52]:
index[1:]

Index(['b', 'c'], dtype='object')

In [54]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5,-2.5,0],index=index)
obj2.index is index

True

In [55]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [56]:
'Ohio' in frame3.columns

True

In [57]:
2003 in frame3.index

False

In [58]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [59]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [60]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [64]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [66]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [67]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [68]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [75]:
frame.reindex(index=['a','b','c','d'],method='ffill',columns=states)

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [76]:
frame.ix[['a','b','c','d'],states]

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   California  Texas  Utah
a         2.0    1.0   NaN
b         NaN    NaN   NaN
c         5.0    4.0   NaN
d         8.0    7.0   NaN

In [77]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])
new_obj = obj.drop('c')

In [78]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [79]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [80]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [3]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np
obj = Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [4]:
obj['b']

1.0

In [5]:
obj[1]

1.0

In [6]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [7]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [8]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [9]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [11]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [12]:
obj['b':'d'] = 5
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [13]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [14]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [16]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [17]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [18]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [21]:
data[data<5] = 0

In [22]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data.ix['Colorado',['two','three']]

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [24]:
data.ix[['Colorado','Utah'],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [25]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [27]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [28]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
data.ix[data.three>5,:3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [30]:
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [31]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [32]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [34]:
df1 = DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohis','Texas','Oregon'])

In [35]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [36]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohis    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [38]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      NaN NaN   NaN NaN
Ohis      NaN NaN   NaN NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [39]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      0.0  1.0   2.0   NaN
Ohis      3.0  NaN   4.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [40]:
df1.reindex(columns=df2.columns,fill_value=0)

            b    d  e
Ohio      0.0  2.0  0
Texas     3.0  5.0  0
Colorado  6.0  8.0  0

In [41]:
arr = np.arange(12.).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [42]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [43]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [46]:
frame = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
series = frame.ix[0]
frame

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [47]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [48]:
series2 = Series(range(3),index=['b','e','f'])
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [49]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [52]:
series3 = frame['d']

In [53]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [54]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [55]:
frame.sub(series3,axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [56]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

frame

               b         d         e
Utah   -1.277768  0.475464 -0.315882
Ohio    1.144340 -1.927335 -0.974117
Texas  -0.825112  1.256624  0.741078
Oregon  0.402588 -0.246472 -0.049730

In [57]:
np.abs(frame)

               b         d         e
Utah    1.277768  0.475464  0.315882
Ohio    1.144340  1.927335  0.974117
Texas   0.825112  1.256624  0.741078
Oregon  0.402588  0.246472  0.049730

In [58]:
f = lambda x:x.max()-x.min()
frame.apply(f)

b    2.422108
d    3.183959
e    1.715195
dtype: float64

In [59]:
frame.apply(f,axis=1)

Utah      1.753233
Ohio      3.071675
Texas     2.081736
Oregon    0.649060
dtype: float64

In [60]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])

frame.apply(f)

            b         d         e
min -1.277768 -1.927335 -0.974117
max  1.144340  1.256624  0.741078

In [61]:
format = lambda x:'%.2f'%x
frame.applymap(format)

            b      d      e
Utah    -1.28   0.48  -0.32
Ohio     1.14  -1.93  -0.97
Texas   -0.83   1.26   0.74
Oregon   0.40  -0.25  -0.05

In [62]:
obj = Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [63]:
frame = DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [64]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [66]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [67]:
obj = Series([4,7,-3,2])
obj.order()

AttributeError: 'Series' object has no attribute 'order'

In [69]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [70]:
frame.sort_index(by='b')

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [71]:
frame.sort_index(by=['a','b'])

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [72]:
obj = Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [73]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [74]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [75]:
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [76]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [77]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [78]:
frame.index.is_unique

True

In [79]:
df = DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [80]:
df

          0         1         2
a -1.127649 -1.674677  0.015422
a  1.148042  1.227779 -0.279620
b -0.439961  1.302071  0.249150
b  0.567973 -1.554554  0.632899

In [81]:
df.ix['b']

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b -0.439961  1.302071  0.249150
b  0.567973 -1.554554  0.632899

In [82]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [83]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [84]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [85]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [87]:
df.idxmax()

one    b
two    d
dtype: object

In [88]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [89]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [100]:
import pandas_datareader.data as web
all_data = {}
for ticker in['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')

price = DataFrame({tic:data['Adj Close'] for tic,data in all_data.iteritems()})
volumne = DataFrame({tic:data['Volume'] for tic,data in all_data.iteritems()})

returns = price.pct_change()
returns.tail()

RemoteDataError: Unable to read URL: https://query1.finance.yahoo.com/v7/finance/download/AAPL?period1=946656000&period2=1262361599&interval=1d&events=history&crumb=tUQ%5Cu002F5Ido8jB

In [101]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [102]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [103]:
pd.value_counts(obj.values,sort=False)

d    1
b    2
a    3
c    3
dtype: int64

In [104]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [105]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [107]:
data = DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [108]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [109]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [110]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [111]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [113]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [114]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [115]:
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna()

In [116]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [117]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [118]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [119]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [120]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [121]:
df = DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -1.720118  1.216202  0.549868
1  2.009659 -1.103900  0.317993
2 -0.788856  1.912527  2.085885
3 -0.463214 -0.714541  0.807694
4 -1.480554  0.151180  0.794593
5  0.611092 -0.576291 -0.324684
6 -0.927443 -0.656405  1.820085

In [122]:
df.ix[:4,1] = NA;df.ix[:2,2] = NA
df

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
0 -1.720118       NaN       NaN
1  2.009659       NaN       NaN
2 -0.788856       NaN       NaN
3 -0.463214       NaN  0.807694
4 -1.480554       NaN  0.794593
5  0.611092 -0.576291 -0.324684
6 -0.927443 -0.656405  1.820085

In [123]:
df.fillna(0)

          0         1         2
0 -1.720118  0.000000  0.000000
1  2.009659  0.000000  0.000000
2 -0.788856  0.000000  0.000000
3 -0.463214  0.000000  0.807694
4 -1.480554  0.000000  0.794593
5  0.611092 -0.576291 -0.324684
6 -0.927443 -0.656405  1.820085

In [124]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -1.720118  0.500000       NaN
1  2.009659  0.500000       NaN
2 -0.788856  0.500000       NaN
3 -0.463214  0.500000  0.807694
4 -1.480554  0.500000  0.794593
5  0.611092 -0.576291 -0.324684
6 -0.927443 -0.656405  1.820085

In [125]:
df.fillna(0,inplace=True)#总是返回补填充对象的引用
df

          0         1         2
0 -1.720118  0.000000  0.000000
1  2.009659  0.000000  0.000000
2 -0.788856  0.000000  0.000000
3 -0.463214  0.000000  0.807694
4 -1.480554  0.000000  0.794593
5  0.611092 -0.576291 -0.324684
6 -0.927443 -0.656405  1.820085

In [126]:
df = DataFrame(np.random.randn(6,3))
df.ix[2:,1] = NA; df.ix[4:,2] = NA
df

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

          0         1         2
0  1.181349  1.134381  0.458498
1 -0.157239  0.236523  0.707719
2  1.022628       NaN  0.283215
3 -0.479042       NaN -2.474709
4  0.790735       NaN       NaN
5 -0.408727       NaN       NaN

In [127]:
df.fillna(method='ffill')

          0         1         2
0  1.181349  1.134381  0.458498
1 -0.157239  0.236523  0.707719
2  1.022628  0.236523  0.283215
3 -0.479042  0.236523 -2.474709
4  0.790735  0.236523 -2.474709
5 -0.408727  0.236523 -2.474709

In [128]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.181349  1.134381  0.458498
1 -0.157239  0.236523  0.707719
2  1.022628  0.236523  0.283215
3 -0.479042  0.236523 -2.474709
4  0.790735       NaN -2.474709
5 -0.408727       NaN -2.474709

In [129]:
data = Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [130]:
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data

a  1   -0.841483
   2    0.658747
   3    0.894062
b  1    1.517014
   2   -1.265868
   3    0.442479
c  1    1.675541
   2    0.298762
d  2   -0.341299
   3   -0.148977
dtype: float64

In [131]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [132]:
data['b']

1    1.517014
2   -1.265868
3    0.442479
dtype: float64

In [133]:
data['b':'d']

b  1    1.517014
   2   -1.265868
   3    0.442479
c  1    1.675541
   2    0.298762
d  2   -0.341299
   3   -0.148977
dtype: float64

In [134]:
data.ix[['b','d']]

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1    1.517014
   2   -1.265868
   3    0.442479
d  2   -0.341299
   3   -0.148977
dtype: float64

In [135]:
data[:,2]

a    0.658747
b   -1.265868
c    0.298762
d   -0.341299
dtype: float64

In [136]:
data.unstack()

          1         2         3
a -0.841483  0.658747  0.894062
b  1.517014 -1.265868  0.442479
c  1.675541  0.298762       NaN
d       NaN -0.341299 -0.148977

In [137]:
data.unstack().stack()

a  1   -0.841483
   2    0.658747
   3    0.894062
b  1    1.517014
   2   -1.265868
   3    0.442479
c  1    1.675541
   2    0.298762
d  2   -0.341299
   3   -0.148977
dtype: float64

In [138]:
frame = DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [139]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [140]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [141]:
MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names=['state','color'])

NameError: name 'MultiIndex' is not defined

In [142]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [143]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [144]:
frame.sortlevel(1)

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [145]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [146]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [148]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [149]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [150]:
frame2 = frame.set_index(['c','d'])

In [151]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [155]:
frame2 = frame.set_index(['c','d'],drop=False)

In [156]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [157]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [159]:
ser = Series(np.arange(3.))

In [160]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [161]:
ser[-1]

KeyError: -1

In [162]:
ser2 = Series(np.arange(3.),index=['a','b','c'])
ser2[-1]

2.0

In [163]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [164]:
ser.ix[:1]

d:\www\learn-python\venv\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64

In [165]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [166]:
ser3 = Series(range(3),index=[-5,1,3])
ser3.iget_value(2)

AttributeError: 'Series' object has no attribute 'iget_value'

In [169]:
frame = DataFrame(np.arange(6).reshape(3,2),index=[2,0,1])
frame.irow(0)

AttributeError: 'DataFrame' object has no attribute 'row'

In [170]:
import pandas_datareader.data as web
pdata = pd.Panel(dict((stk,web.get_data_yahoo(stk,'1/1/2009','6/1/2012')) for stk in ['AAPL','GOOG','MSFT','DELL']))

pdata

RemoteDataError: Unable to read URL: https://query1.finance.yahoo.com/v7/finance/download/DELL?period1=1230739200&period2=1338566399&interval=1d&events=history&crumb=1fQTSGxtrNV